app/controllers/acceuil_controller.rb

  def racine
  	@u = Gossip.all
---
SELECT  "gossips".* FROM "gossips" WHERE (:1) LIMIT $1  [["LIMIT", 1]]