app/controllers/afficher_detail_controller.rb

  def afficher_detail
     @u = Gossip.all
     @first_name=Gossip.find(params[:id_gossip]).user.first_name
     @titre=Gossip.find(params[:id_gossip]).title
     @content=Gossip.find(params[:id_gossip]).content
     @date=Gossip.find(params[:id_gossip]).created_at
---
SELECT "gossips".* FROM "gossips"
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]