app/views/afficher_detail/afficher_detail.html.erb


      <td style="font-size: 90%; width: 20%;text-shadow: 1px 1px 1px silver;"><%= i.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]